Revit 2027 API
RebarFreeFormAccessor.GetDefaultPositiveDirectionForMorphedTargetEdgesHandle Method
 Gets the default positive direction of the specified target rebar edge in terms of how Morphed Free Form Rebar is defining the default positive direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ GetDefaultPositiveDirectionForMorphedTargetEdgesHandle(
	Document document,
	TargetRebarEdge targetRebarEdge,
	int barIndex
)
Public Shared Function GetDefaultPositiveDirectionForMorphedTargetEdgesHandle (
	document As Document,
	targetRebarEdge As TargetRebarEdge,
	barIndex As Integer
) As XYZ
public:
static XYZ^ GetDefaultPositiveDirectionForMorphedTargetEdgesHandle(
	Document^ document,
	TargetRebarEdge^ targetRebarEdge,
	int barIndex
)
static member GetDefaultPositiveDirectionForMorphedTargetEdgesHandle :
        document : Document *
        targetRebarEdge : TargetRebarEdge *
        barIndex : int -> XYZ
Parameters
document Document
 The document that contains the target rebar.
targetRebarEdge TargetRebarEdge
 The target rebar edge for which it will get the default positive direction.
barIndex Int32
 The index of the bar in the target set. Should be between 0 and NumberOfBars() - 1.
Return Value
XYZ
 Returns the default positive direction of the specified target rebar edge.
Exceptions
Exception | Condition
ArgumentException |  The target rebar should be a valid Rebar Target and bar index should be between 0 and NumberOfBars() - 1.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace